app/views/employees/show.html.erb

SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 5]]
---

            <% if @employee.documents.present?%>

SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 3]]
---
                    <h1 class="text-center">Document Details</h1>
                    <% @employee.documents.each do  |document|%>