app/controllers/documents_controller.rb

        def create
            @document = Document.new(document_params)

            if @document.save
---
INSERT INTO "documents" ("name", "doc_type", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Marksheet"], ["doc_type", "Educational"], ["employee_id", 4], ["created_at", "2024-04-21 11:04:02.152241"], ["updated_at", "2024-04-21 11:04:02.152241"]]

        def update
            #@employee = Employee.find(params[:id])
            if @document.update(document_params)
---
UPDATE "documents" SET "name" = ?, "doc_type" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["name", "10th Marksheet"], ["doc_type", "Marksheet"], ["updated_at", "2024-04-21 11:22:22.858487"], ["id", 1]]