app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "email", "city", "state", "country", "pincode", "address_line_1", "address_line_2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @employee = Employee.new(employee_params)

        if @employee.save

UPDATE "employees" SET "address_line_1" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address_line_1", "12eerthj"], ["updated_at", "2024-04-17 18:17:36.261076"], ["id", 3]]
---
    def update
        #@employee = Employee.find(params[:id])
        if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 6]]
---
    def destroy
        #@employee = Employee.find(params[:id])
        if @employee.destroy